; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v4 - type_2 ?v1 - type_3)
 	      (pred_3 ?v2 - object ?v1 - type_3)
	      (pred_4 ?v4 - type_2 ?v5 - type_1)
	      (pred_2 ?v4 - type_2 ?v2 - object ?v5 - type_1))

   (:action op_2
       :parameters  (?v4 - type_2 ?v3 ?v8 - type_3)
       :precondition (and  (pred_1 ?v4 ?v3))
       :effect (and  (pred_1 ?v4 ?v8)
		     (not (pred_1 ?v4 ?v3))))

   (:action op_3
       :parameters (?v4 - type_2 ?v6 - object ?v7 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_3 ?v6 ?v7) (pred_1 ?v4 ?v7) (pred_4 ?v4 ?v5))
       :effect (and (pred_2 ?v4 ?v6 ?v5)
		    (not (pred_3 ?v6 ?v7)) 
		    (not (pred_4 ?v4 ?v5))))

   (:action op_1
       :parameters (?v4 - type_2 ?v6 - object ?v7 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_2 ?v4 ?v6 ?v5) (pred_1 ?v4 ?v7))
       :effect (and (pred_3 ?v6 ?v7)
		    (pred_4 ?v4 ?v5)
		    (not (pred_2 ?v4 ?v6 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_02 obj_04 - type_2
obj_01 obj_12 obj_11 obj_05 - type_1
obj_09 obj_08 obj_03 obj_14 - type_3
obj_07 obj_06 obj_10 obj_13 - object)
(:init
(pred_1 obj_02 obj_08)
(pred_4 obj_02 obj_01)
(pred_4 obj_02 obj_12)
(pred_1 obj_04 obj_08)
(pred_4 obj_04 obj_11)
(pred_4 obj_04 obj_05)
(pred_3 obj_07 obj_08)
(pred_3 obj_06 obj_03)
(pred_3 obj_10 obj_14)
(pred_3 obj_13 obj_09)
)
(:goal
(and
(pred_3 obj_07 obj_08)
(pred_3 obj_06 obj_03)
(pred_3 obj_10 obj_03)
(pred_3 obj_13 obj_08)
)
)

(:constraints
  (always (not (pred_1 obj_02 obj_03)))
)
)

; plan
1. (op_2 obj_02 obj_08 obj_09)
   deleted: (pred_1 obj_02 obj_08)
   added: (pred_1 obj_02 obj_09)
   goals met: 2 of 4
2. (op_2 obj_04 obj_08 obj_14)
   deleted: (pred_1 obj_04 obj_08)
   added: (pred_1 obj_04 obj_14)
   goals met: 2 of 4
3. (op_3 obj_04 obj_10 obj_14 obj_05)
   deleted: (pred_3 obj_10 obj_14) (pred_4 obj_04 obj_05)
   added: (pred_2 obj_04 obj_10 obj_05)
   goals met: 2 of 4
4. (op_3 obj_02 obj_13 obj_09 obj_12)
   deleted: (pred_3 obj_13 obj_09) (pred_4 obj_02 obj_12)
   added: (pred_2 obj_02 obj_13 obj_12)
   goals met: 2 of 4
5. (op_2 obj_04 obj_14 obj_03)
   deleted: (pred_1 obj_04 obj_14)
   added: (pred_1 obj_04 obj_03)
   goals met: 2 of 4
6. (op_2 obj_02 obj_09 obj_08)
   deleted: (pred_1 obj_02 obj_09)
   added: (pred_1 obj_02 obj_08)
   goals met: 2 of 4
7. (op_1 obj_04 obj_10 obj_03 obj_05)
   deleted: (pred_2 obj_04 obj_10 obj_05)
   added: (pred_3 obj_10 obj_03) (pred_4 obj_04 obj_05)
   goals met: 3 of 4
8. (op_1 obj_02 obj_13 obj_08 obj_12)
   deleted: (pred_2 obj_02 obj_13 obj_12)
   added: (pred_3 obj_13 obj_08) (pred_4 obj_02 obj_12)
   goals met: 4 of 4
